import { IMessage } from "../model/message";

export const chatMessages: IMessage[] = [
  {
    idChat: 1,
    messages: [
      "Привет! Как дела?",
      "Все отлично, спасибо! Как ты?",
      "Тоже хорошо. Чем занимаешься?",
      "Смотрю сериал. А ты?",
      "Работаю над проектом."
    ],
    dateLastMess: [
      new Date('2024-07-15T10:00:00'),
      new Date('2024-07-15T10:05:00'),
      new Date('2024-07-15T10:10:00'),
      new Date('2024-07-15T10:15:00'),
      new Date('2024-07-15T10:20:00')
    ]
  },
  {
    idChat: 4,
    messages: [
      "Отправил документы на почту.",
      "Спасибо! Получил.",
      "Если будут вопросы, дай знать.",
      "Хорошо, обязательно.",
      "Отличного дня!"
    ],
    dateLastMess: [
      new Date('2024-07-16T09:00:00'),
      new Date('2024-07-16T09:05:00'),
      new Date('2024-07-16T09:10:00'),
      new Date('2024-07-16T09:15:00'),
      new Date('2024-07-16T09:20:00')
    ]
  },
  {
    idChat: 6,
    messages: [
      "Завтра я тебя жду",
      "Я закажу пиццу",
      "Возьми, пожалуйста, напитки",
      "И выбери что смотреть будем",
      "Жду!"
    ],
    dateLastMess: [
      new Date('2024-07-17T10:00:00'),
      new Date('2024-07-17T10:02:00'),
      new Date('2024-07-17T10:05:00'),
      new Date('2024-07-17T10:08:00'),
      new Date('2024-07-17T10:10:00')
    ]
  },
  {
    idChat: 9,
    messages: [
      "Где завтра встречаемся?",
      "Документы все готовы",
      "Я их принесу",
      "Еще зайдем в ремонт телефонов?",
      "Мне нужно отнести свой телефон"
    ],
    dateLastMess: [
      new Date('2024-07-18T11:00:00'),
      new Date('2024-07-18T11:05:00'),
      new Date('2024-07-18T11:10:00'),
      new Date('2024-07-18T11:15:00'),
      new Date('2024-07-18T11:20:00')
    ]
  },
];